sims/SIM_Slosh_40/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}

lateralThrust
{
    type            accelerationSource;
    active          yes;

    selectionMode   all;

    U               U;

    value           (1 0 0);

    velocity        scale;

    scale
    {
        type        table;
        values
        (
            // time [s]    accel magnitude [m/s^2]
            (0.00   0.00)
            (0.20   0.00)
            (0.30   0.00)
            (0.40   0.00)
            (0.500   0.000000)
            (0.501   0.000001)
            (0.502   0.000003)
            (0.503   0.000007)
            (0.504   0.000013)
            (0.505   0.000021)
            (0.506   0.000030)
            (0.507   0.000040)
            (0.508   0.000053)
            (0.509   0.000067)
            (0.510   0.000082)
            (0.511   0.000100)
            (0.512   0.000118)
            (0.513   0.000139)
            (0.514   0.000161)
            (0.515   0.000185)
            (0.516   0.000211)
            (0.517   0.000238)
            (0.518   0.000266)
            (0.519   0.000297)
            (0.520   0.000329)
            (0.521   0.000363)
            (0.522   0.000398)
            (0.523   0.000435)
            (0.524   0.000474)
            (0.525   0.000514)
            (0.526   0.000556)
            (0.527   0.000599)
            (0.528   0.000645)
            (0.529   0.000691)
            (0.530   0.000740)
            (0.531   0.000790)
            (0.532   0.000842)
            (0.533   0.000895)
            (0.534   0.000950)
            (0.535   0.001007)
            (0.536   0.001065)
            (0.537   0.001125)
            (0.538   0.001187)
            (0.539   0.001250)
            (0.540   0.001315)
            (0.541   0.001382)
            (0.542   0.001450)
            (0.543   0.001520)
            (0.544   0.001591)
            (0.545   0.001664)
            (0.546   0.001739)
            (0.547   0.001815)
            (0.548   0.001893)
            (0.549   0.001973)
            (0.550   0.002054)
            (0.551   0.002137)
            (0.552   0.002222)
            (0.553   0.002308)
            (0.554   0.002396)
            (0.555   0.002485)
            (0.556   0.002576)
            (0.557   0.002669)
            (0.558   0.002763)
            (0.559   0.002859)
            (0.560   0.002957)
            (0.561   0.003056)
            (0.562   0.003157)
            (0.563   0.003260)
            (0.564   0.003364)
            (0.565   0.003470)
            (0.566   0.003577)
            (0.567   0.003686)
            (0.568   0.003797)
            (0.569   0.003909)
            (0.570   0.004023)
            (0.571   0.004138)
            (0.572   0.004256)
            (0.573   0.004374)
            (0.574   0.004495)
            (0.575   0.004617)
            (0.576   0.004741)
            (0.577   0.004866)
            (0.578   0.004993)
            (0.579   0.005121)
            (0.580   0.005251)
            (0.581   0.005383)
            (0.582   0.005517)
            (0.583   0.005652)
            (0.584   0.005788)
            (0.585   0.005927)
            (0.586   0.006067)
            (0.587   0.006208)
            (0.588   0.006351)
            (0.589   0.006496)
            (0.590   0.006642)
            (0.591   0.006790)
            (0.592   0.006940)
            (0.593   0.007091)
            (0.594   0.007244)
            (0.595   0.007398)
...
            (5.00   0.00)

        );
    }
}

// ************************************************************************* //